descent/stm32f4_prog/coroutine/sample.c
// http://wiki.csie.ncku.edu.tw/embedded/Lab2
/* use setjmp/longjmp to implement coroutines */

#include "stm32.h"
#include "my_setjmp.h"
#include "type.h"

#define setjmp my_setjmp
#define longjmp my_longjmp

#define STACK_SIZE 4096

char memarea1[128];
char memarea2[128];

/*
 * Change SP prior to calling setjmp so that longjmp will
 * start the routine with 'stackptr'.
 */
#if defined(__i386__)
#define SAVE_STACK_POINTER_ASM(savedstack, stackptr) \
	"movl %%esp, %[savedstack]\n" /* savedstack <- SP */ \
	"movl %[stackptr], %%esp"    /* SP <- stackptr */
#elif defined(__x86_64__)
#define SAVE_STACK_POINTER_ASM(savedstack, stackptr) \
	"movq %%rsp, %[savedstack]\n" /* savedstack <- SP */ \
	"movq %[stackptr], %%rsp"    /* SP <- stackptr */
#else
//#error "Unsupported architecture!"
#define SAVE_STACK_POINTER_ASM(savedstack, stackptr) \
	"mov %[savedstack], %%sp\n" /* savedstack <- SP */ \
	"mov %%sp, %[stackptr]"    /* SP <- stackptr */
#endif


#define SAVE_STACK_POINTER(savedstack, stackptr) \
do { \
	asm volatile ( SAVE_STACK_POINTER_ASM(savedstack, stackptr) \
	: [savedstack] "=r" (savedstack): [stackptr] "r" (stackptr) ); \
} while (0)

/* Restore "normal" stack prior to return */
#if defined(__i386__)
#define RESTORE_STACK_ASM(savedstack) \
	"movl %[savedstack],%%esp"
#elif defined(__x86_64__)
#define RESTORE_STACK_ASM(savedstack) \
	"movq %[savedstack],%%rsp"
#else
#define RESTORE_STACK_ASM(savedstack) \
	"mov %%sp, %[savedstack]"
//#error "Unsupported architecture!"
#endif


#define RESTORE_STACK(savedstack) \
do { \
	asm volatile ( RESTORE_STACK_ASM(savedstack) \
	: : [savedstack] "r" (savedstack)); \
} while (0)	

jmp_buf routine1_buf;
jmp_buf routine2_buf;

// sign version
char* s32_itoa_s(int n, char* str, int radix)
{
  char digit[]="0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
  char* p=str;
  char* head=str;
  //int radix = 10;

//  if(!p || radix < 2 || radix > 36)
//    return p;
  if (n==0)
  {
    *p++='0';
    *p=0;
    return str;
  }
  if (radix == 10 && n < 0)
  {
    *p++='-';
    n= -n;
  }
  while(n)
  {
    *p++=digit[n%radix];
    //s32_put_char(*(p-1), (u8*)(0xb8000+80*2));
    n/=radix;
  }
  *p=0;
  #if 1
  for (--p; head < p ; ++head, --p)
  {
    char temp=*head;
    if (*(p-1) != '-')
    {
      *head=*p;
      *p=temp;
    }
  }
  #endif
  return str;
}

int exit(int i)
{
  while(1);
}

void *malloc(int size)
{
}


void print_str(const char *str)
{
}

void print_int(int n)
{
  char str[20];
  s32_itoa_s(n, str, 10);
  print_str(str);
}

void printf(char *str, ...)
{
}

void routine1()
{
	volatile unsigned count = 0;

	/* Start of Routine #1 */
	setjmp(routine1_buf);

	printf("[Routine 1] pass %d\n", ++count);

	longjmp(routine2_buf, 1);
}

void create_routine1(const void *stackptr)
{
	register unsigned long savedstack;

	//SAVE_STACK_POINTER(savedstack, stackptr);

        asm volatile (
                       "mov %0, %%sp"
                       :"=r"(savedstack)
                       :
                     );
        asm volatile (
                       "mov %%sp, %0"
                       :
                       :"r"(stackptr)
                     );


	if (setjmp(routine1_buf) == 0) {
		//RESTORE_STACK(savedstack);
        asm volatile (
                       "mov %%sp, %0"
                       :
                       :"r"(savedstack)
                     );

	}
	else {
		/* We got here through longjmp */
		routine1();
	}
}

#define FINAL_NUM 5
void routine2()
{
	volatile unsigned count = 0;

	/* Start of Routine #2 */
	setjmp(routine2_buf);

	printf("[Routine 2] pass %d\n", (FINAL_NUM - ++count));

	if (count < FINAL_NUM)
		longjmp(routine1_buf, 1);

	exit(0);
}

void create_routine2(const void *stackptr)
{
	register unsigned long savedstack;

	SAVE_STACK_POINTER(savedstack, stackptr);

	if (setjmp(routine2_buf) == 0) {
		RESTORE_STACK(savedstack);
	}
	else {
		routine2();
	}
}


int main(void)
{
  //create_routine1((char *) malloc(STACK_SIZE) + STACK_SIZE);
  //create_routine2((char *) malloc(STACK_SIZE) + STACK_SIZE);
  create_routine1(memarea1);
  create_routine2(memarea2);
  longjmp(routine1_buf, 1);

  return 0;
}
